//Процедура ОбработкаПроведения(Отказ,Режим)
//	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
//	//Данный фрагмент построен конструктором.
//	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
//
//	// регистр ОстаткиМатериалов
//	Движения.ОстаткиМатериалов.Записывать = Истина;
//	Для Каждого ТекСтрокаМатериалы из Материалы Цикл
//		Движение = Движения.ОстаткиМатериалов.Добавить();
//		Движение.Период = Дата;
//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//		Движение.Материал = ТекСтрокаМатериалы.Материал;
//		Движение.Склад = Склад;
//		Движение.Количество = ТекСтрокаМатериалы.Количество;
//	КонецЦикла;
//
//	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
//КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)	
		Движения.ОстаткиМатериалов.Записывать = Истина;
		Движения.СтоимостьМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
			// Регистр ОстаткиМатериалов Приход
			Движение = Движения.ОстаткиМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Материал = ТекСтрокаМатериалы.Материал;
			Движение.Склад = Склад;
			Движение.Количество = ТекСтрокаМатериалы.Количество;
			
			
			
			// Регистр Стоимость Материалов Приход
			Движение = Движения.СтоимостьМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Материал = ТекСтрокаМатериалы.Материал;
			Движение.Стоимость = ТекСтрокаМатериалы.Сумма;
	КонецЦикла;
КонецПроцедуры